x=int(input("Сколько вы хотите купить шаров?: "))

if x != 1 and x !=2 and x != 4 and x != 7:
    print("Да")
else:print("нет")


#Математическая задача которая доказана. Гугли если что
# Задание
# В магазине продают только по три и по пять воздушных шариков.
#
# Можно ли купить ровно k шариков?
#
#
#
# Формат входных данных
# Дано целое положительное число, количество шариков,
# которые вы планируете купить.
#
# Формат выходных данных
# Вывести "Да", если данное количество шариков можно
# приобрести в магазине. И "Нет", если нельзя.