# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
print(", ".join(names))
# for name in names:
#     print(name, end=", ")
# решение неверно
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр